Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.SelectionTypes
The export selection types.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.SelectionTypes.AllObjects
Export all objects.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.SelectionTypes.SelectedObjects
Export selected objects.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.SelectionTypes.SelectedObjectsAndTheirAssemblies
Export selected objects and their assemblies.